<template>
  <div class="container">
    <TheMain />
    <TheExperience />
    <TheContacts />
  </div>
</template>

<script>
export default {
  mounted() {
    this.$i18n.locale = 'ru';
  },
  setup() {
    useSeoMeta({
      title: 'Федянов Степан – Фронтенд-разработчик | Резюме',
      ogTitle: 'Федянов Степан – Фронтенд-разработчик | Резюме',
      description:
        'Фронтенд-разработчик на VueJS. Прохожу стажировку в Студии Артемия Лебедева. Разработал более 20 проектов, 15 их которых получили высшую оценку от заказчика. Получил специальный статус «Восходящая звезда» за скорость и качество выполнения заказов.',
      ogDescription:
        'Фронтенд-разработчик на VueJS. Прохожу стажировку в Студии Артемия Лебедева. Разработал более 20 проектов, 15 их которых получили высшую оценку от заказчика. Получил специальный статус «Восходящая звезда» за скорость и качество выполнения заказов.',
      ogImage: '/ogImage.png',
      twitterCard: 'summary_large_image',
    });
  },
};
</script>
